"""
1. Напишите программу для преобразования списка в кортеж
"""

my_list = [1, 2, 3, 4, 5]
my_tuple = tuple(my_list)

print(f"type: {type(my_tuple)}, value: {my_tuple}")
