"""
2. Напишите программу Python, которая принимает слово от пользователя и переворачивает его Пример:
input - Hello Worlds output - sdlroW olleH
"""

words = input("Введите слово: ")

print(words[::-1])
