"""
9. Напишите программу для объединения следующих словарей для создания нового. Исходные словари:

dic1={1:10, 2:20}
dic2={3:30, 4:40}
dic3={5:50, 6:60}

Результат: {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}
"""
dic1 = {1: 10, 2: 20}
dic2 = {3: 30, 4: 40}
dic3 = {5: 50, 6: 60}
my_dict = {}

for key, value in (dic1.items(), dic2.items(), dic3.items()):
    my_dict[key, value] = key, value

print(my_dict)
